In [1]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine
db_warehouse = create_engine('postgresql://marcel:4UTebmZgDs7Hyfsq@warehouse:5432/warehouse')
db_replication = create_engine('postgresql://francois:4RzVZ2JmndK@db-slave2:5432/lottostar')
start_date = '2018-06-11'
end_date = '2018-06-14'

In [2]:
sql_query="""
select date(created_at) as bet_date, 
       user_id, 
       sum(total_value) as bet_value 
from play_transaction 
where transaction_type='2' AND payment_status='1' and created_at >= '{}' and created_at < '{}' and not is_cancelled group by 1,2 order by 1,2 """.format(start_date, end_date)

In [3]:
df1 = pd.read_sql_query(sql_query, con=db_warehouse)
df2 = pd.read_sql_query(sql_query, con=db_replication)

In [4]:
df1.shape

(13165, 3)

In [5]:
df1.tail()

         bet_date  user_id  bet_value
13160  2018-06-13   313354        7.5
13161  2018-06-13   313356       23.5
13162  2018-06-13   313362       20.0
13163  2018-06-13   313363       47.0
13164  2018-06-13   313372      235.0

In [6]:
df2.shape

(13166, 3)

In [7]:
df2.tail()

         bet_date  user_id  bet_value
13161  2018-06-13   313354        7.5
13162  2018-06-13   313356       23.5
13163  2018-06-13   313362       20.0
13164  2018-06-13   313363       47.0
13165  2018-06-13   313372      235.0

In [8]:
df2['bet_value'].sum() == df2['bet_value'].sum()

True

In [9]:
df1.groupby(['user_id','bet_date']).mean().head()

                    bet_value
user_id bet_date
41      2018-06-11       30.0
        2018-06-12       81.0
89      2018-06-11      269.0
        2018-06-12      335.0
        2018-06-13      201.0